# Tratamento de dados ausentes

In [1]:
import pandas as pd
import numpy as np

In [3]:
dataframe = pd.DataFrame({ "A": [1, np.nan, 2],
                           "B": [5, np.nan, np.nan],
                           "C": [1, 2, 3]})

In [4]:
dataframe

     A    B  C
0  1.0  5.0  1
1  NaN  NaN  2
2  2.0  NaN  3

In [5]:
dataframe.dropna()

     A    B  C
0  1.0  5.0  1

In [7]:
dataframe.dropna(axis=1)

   C
0  1
1  2
2  3

In [8]:
dataframe.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  NaN  2
2  2.0  3

In [9]:
dataframe.fillna("Valor")

       A      B  C
0    1.0    5.0  1
1  Valor  Valor  2
2    2.0  Valor  3

In [12]:
dataframe["A"].fillna(value=dataframe["A"].mean())

0    1.0
1    1.5
2    2.0
Name: A, dtype: float64

In [13]:
dataframe

     A    B  C
0  1.0  5.0  1
1  NaN  NaN  2
2  2.0  NaN  3

In [14]:
dataframe.ffill()

     A    B  C
0  1.0  5.0  1
1  1.0  5.0  2
2  2.0  5.0  3

In [15]:
dataframe.bfill()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  2.0  NaN  3